#include <windows.h>
#include <iostream>

using namespace std;

int main()
{
	cout << "Help Me!" << endl;

	return EXIT_SUCCESS;
}

//Игра на C++ и SFML
//SFML - канвас для C++, который позволяет рисовать графику
//Для игры сделать такие же шаги как на практике
//Название, логлайн, цель, препятствие, жанр, таблица сравнения, MindMap, RoadMap
//Логлайн - краткое описание сюжета и положения дел в игре
//Таблица сравнения - название игры, что в ней понравилось, насколько понравилось
//MindMap - возможные состояния игры, например, меню/геймплей, у меню есть несколько пунктов и т.д.
//!НЕРЕАЛЬНО! Нарисовать круг